export enum EnumDiagName {
    График = 'График',
    ГладкГрафик = 'Гладкий график',
    КомбДиаг = 'Комбинированная диаграмма',
    ДиагОбл = 'Диаграмма с областями',
    ДиагОблНакоп = 'Диаграмма с областями и накоплением',
    НормирДиагОбл = 'Нормированная диаграмма с областями',
    ДискрДиагОбл = 'Дискретная диаграмма с областями',
    ДискрДиагОблНакоп = 'Дискретная диаграмма с областями и накоплением',
    НормирДискрДиагОбл = 'Нормированная дискретная диаграмма с областями',
    СтолбДиаг = 'Столбчатая диаграмма',
    СтолбДиагНакоп = 'Столбчатая диаграмма с накоплением',
    НормирСтолбДиаг = 'Нормированная столбчатая диаграмма',
    ЛинДиаг = 'Линейчатые диаграмма',
    ЛинДиагНакоп = 'Линейчатые диаграмма с накоплением',
    НормирЛинДиаг = 'Нормированная линейчатая диаграмма',
    КругДиаг = 'Круговая диаграмма',
    КольцДиаг = 'Кольцевая диаграмма',
    ТочечДиаг = 'Точечная диаграмма',
    ПузДиаг = 'Пузырьковая диаграмма',
}
export enum EnumAccumType {
    Нет = 'Нет',
    Стандартная = 'Стандартная',
    Нормированная = 'Нормированная'
}
export enum EnumJoinType {
    Погоризонтали = 'По горизонтали',
    Повертикали = 'По вертикали',
}

export enum EnumUnionType {
    Сумма = 'Сумма',
    Среднее = 'Среднее',
    Количество = 'Количество',
    Максимум = 'Максимум',
    Минимум = 'Минимум',
    Медиана = 'Медиана'
}

export enum EnumDiagType {
    Line = 'line',
    Bar = 'bar',
    Bubble = 'bubble',
    Doughnut = 'doughnut',
    PolarArea = 'polarArea',
    Radar = 'radar',
    Scatter = 'scatter',
    Pie = 'pie'
}

